#+title: C言語練習
#+startup: content
#+options: todo:nil

学習の流れ

*** DONE helloworld.cの作成

適当なテキストエディタを使ってhelloworld.cを作成して下さい。中身は以下のとおりです。

#+name: helloworld
#+caption: 最初のソースコード helloworld.c
#+begin_src C :exports code :results output :tangle helloworld.c :cache yes
#include <stdio.h>

int main(void)
{
  printf("Hello, world!\n");
  return 0;
}
#+end_src

#+RESULTS[4741b105d0ea1c236aa0ab8a97c2697f2d670e55]: helloworld
: Hello, world!

#+RESULTS:

プログラム(ソースコード)を記述したこの様なファイルをソースファイルと言います。

*** DONE 既存コマンドの終了ステータスの確認

true, falseコマンドを例に~$?~の実行結果を確認してみましょう。
まずは、以下のコマンドでtrueとfalseのマニュアルを確認して下さい。

#+begin_example
$ man true
$ man false
#+end_example

マニュアルの関連項目には完全なマニュアルはTexinfoマニュアルとして整備されていると記載があります。
以下のコマンドで確認してみてください。

#+begin_example
$ info true
$ info false
#+end_example

infoによるとtrueは、成功を意味する0を返し、falseは失敗を意味する1を返すと記載されています。

実際にtrue, falseコマンドを実行しマニュアルに記載された通りの終了ステータスが得られることを
確認してみます。

#+name: trueの終了ステータス
#+begin_src shell :exports both :cache yes
true; echo $?
#+end_src

結果は以下のようになります。

#+RESULTS[f52d9371b0303e5998357ceb591fab583f49f0c3]: trueの終了ステータス
: 0

falseコマンドも同じように確認してみます。

#+name: falseの終了ステータス
#+begin_src shell :exports both :cache yes
false; echo $?
#+end_src

#+RESULTS[2e6f0f8c253db5b8e94c4d534f74797c1a9bc1c0]: falseの終了ステータス
: 1

**** DONE 練習 : grepコマンドの終了ステータス確認

tureやfalseの他にgrepコマンドなども成功と失敗を返しています。
grepのマニュアルを参照し、どの様な終了ステータスを返すのかを確認してみて下さい。

#+begin_example
man grep
#+end_example

マニュアルには選択行が見つかった場合は0, 見つからなかった場合は1と記載があります。
見つかる場合と見つからない場合の2ケースを実際に試し終了ステータスを確認して下さい。

#+name: grep終了ステータス正常
#+begin_src shell :exports both :results output :cache yes
echo abc | grep a; echo $?
#+end_src

#+RESULTS[6d62498256c5294bb42f300ac4d0f33255506e9e]: grep終了ステータス正常
: abc
: 0

#+name: grep終了ステータス失敗
#+begin_src shell :exports both :results output :cache yes
echo abc | grep d; echo $?
#+end_src

#+RESULTS[4f4d7dcc1952a6905f6921000bb3846ce4e3bcba]: grep終了ステータス失敗
: 1

*** DONE 終了ステータスを返すだけの小さなプログラム

C言語では、main関数の戻り値(return 0 の 0)がプログラムの終了ステータスとなります。

helloworld.cでは画面に文字列を出力(printf)するために、おまじない(#include <stdio.h>)を記述しました。
実はこのおまじないは、画面出力(printf)を使用するために記述しています。プログラムの終了ステータスを返すだけの場合は、
画面出力(printf)が不要なので、このおまじないを取り除くことができます。

以下のreturn0.cを作成し実行させてみなさい。

#+name: return0
#+begin_src c :exports code :tangle return0.c
  int main(void) {
    return 0;
  }
#+end_src

#+name return0のビルドと動作確認
#+begin_src shell
  gcc -Wall return0.c
  ./a.out
  echo $?
#+end_src

#+RESULTS:
: 0

このプログラムは--helpや--versionのオプションを受け取れませんが、trueコマンドと同じです。

**** DONE 練習 常に1を返すプログラムの作成と動作確認

常に失敗の終了ステータス1を返すプログラムをmyfalse.c作成し、動作を確認してみなさい。

#+caption: myfalse.c
#+name: myfalse
#+begin_src C :exports code :tangle myfalse.c
  int main(void) {
    return 1;
  }
#+end_src

#+name: myfalseのビルドと動作確認
#+begin_src shell
  gcc -Wall myfalse.c
  ./a.out
  echo $?
#+end_src

#+RESULTS: myfalseのビルドと動作確認
: 1

*** DONE 計算結果を終了ステータスとして返すプログラム(prac02.c)

1 + 2 の計算結果を終了ステータスとして返すプログラムを作成しなさい。
プログラムで計算を行わせるようにし、計算結果の3をプログラム中に埋め込まないようにせよ。

#+begin_src C :tangle prac02.c
  int main(void) {
    return 1 + 2;
  }
#+end_src

#+name: prac02実行結果
#+begin_src shell
  gcc -Wall prac02.c -o prac02
  ./prac02; echo $?
#+end_src

#+RESULTS: prac02実行結果
: 3

*** DONE 整数の和を終了ステータスとして返すプログラム(returnWa1to10.c)

1から10までの整数の和を終了ステータスとして返すプログラムを作成しなさい。
まだ、変数、条件文、繰り返し、再帰などプログラミングに関することを何も説明していないが、
プログラミングを電卓への入力の延長として考えてみよ。

つまりは、電卓を使って、1から10までの和を足し算で求めることができるなら、
同じようにできるはずである。

#+begin_src C :tangle returnWa1to10.c
  int main(void) {
    return 1 + 2 + 3 + 4 + 5 + 6 + 7 + 8 + 9 + 10;
  }
#+end_src

#+name: returnWa1to10の実行結果
#+begin_src shell
  gcc -Wall returnWa1to10.c -o returnWa1to10
  ./returnWa1to10; echo $?
#+end_src

#+RESULTS: returnWa1to10の実行結果
: 55

*** 画面への文字列の出力

画面に文字列を出力するプログラムを作成し、文字列が上下左右のどこからどこに向かって出力されていくのかを
意識して見てみよ。

画面に以下のような文字列を出力するプログラムhello2を作成しなさい。

#+begin_example
hello
hello
#+end_example

#+name: hello2_01
#+begin_src C :results output :tangle hello2.c :cache yes
  #include <stdio.h>

  int main(void) {
    printf("hello\n");
    printf("hello\n");

    return 0;
  }
#+end_src

#+RESULTS[d1606336989156bcd63ffd8785d2764a71ff3320]: hello2_01
: hello
: hello

別の書き方はあるだろうか。

#+name: hello2_02
#+begin_src C :results output :tangle hello2.c :cache yes
  #include <stdio.h>

  int main(void) {
    printf("hello\nhello\n");

    return 0;
  }
#+end_src

小さな例ではあるが、プログラムの実装方法は1つではない。
できるだけわかりやすいほうがよいだろう。

#+RESULTS[f94146d71f6463cc01a3e0b2d36a1c74aff73e23]: hello2_02
: hello
: hello

画面に以下のような文字列を出力するプログラムhello3を作成しなさい。

#+begin_example
hello
 hello
  hello
#+end_example

#+begin_src C :results output :cache yes
  #include <stdio.h>

  int main(void) {
    printf("hello\n");
    printf(" hello\n");
    printf("  hello\n");

    return 0;
  }

#+end_src

#+RESULTS[274011f5270177e9032a2bbb1c5684aa071b88f2]:
: hello
:  hello
:   hello

画面に以下のような文字列を出力するプログラムtreeを作成しなさい。

#+begin_example
    *
   * *
  *   *
 *     *
*********
    *
    *
#+end_example

#+begin_src C :results output
  #include <stdio.h>

  int main(void) {
    printf("    *\n");
    printf("   * *\n");
    printf("  *   *\n");
    printf(" *     *\n");
    printf("*********\n");
    printf("    *\n");
    printf("    *\n");

    return 0;
  }
#+end_src

#+RESULTS:
:     *
:    * *
:   *   *
:  *     *
: *********
:     *
:     *

** DONE 変数からの読込み

変数に書き込んだ値を読み込む場合は単に名前を指定します。

#+name: 変数からの読み込み
#+begin_src C
  int x = 10;
  printf("%d\n", x);
#+end_src

#+RESULTS: 変数からの読み込み
: 10

** DONE 変数の宣言と初期化

変数を宣言する際に初期値を指定すると、指定した値で初期化されます。

#+name: 変数の宣言と初期化
#+begin_src C
  保持したい型の情報 名前(識別子) = 初期値;
#+end_src

#+name: 変数の宣言例
#+begin_src C
  int  x = 10;
#+end_src

[[変数の宣言]]とほぼ違いがありませんが、constで変数を読込み専用にする場合は、宣言時に初期化しなければ、
値を変更することができなくなります。

#+begin_comment
constの例は問題に移動してもよいかも。
#+end_comment

#+name: constの使用例ok
#+begin_src C
  const int ten = 10;
  printf("%d\n", ten);
#+end_src

#+RESULTS: constの使用例ok
: 10

constで指定した値に書き込みを行おうとするとコンパイルエラーとなります。

#+name: constの使用例コンパイルエラー
#+begin_src C
  const int ten;
  ten = 10;
  printf("%d\n", ten);
#+end_src

#+begin_comment
コンパイルエラーを貼り付けたほうが良いかも。
#+end_comment

*** DONE 整数型 int

1週間の日数を保持するint型の変数を使用する以下のプログラムを作成し、実行してみなさい。

#+name: int型変数の例
#+begin_src C :results output :tangle use_int.c
  #include <stdio.h>

  int main(void) {

    int weeknum = 7; /* 一週間の日数 */
    printf("weeknum = %d\n", weeknum);

    printf("sizeof(int) = %zd\n", sizeof(int));
    printf("sizeof(weeknum) = %zd\n", sizeof(weeknum));

    return 0;
  }
#+end_src

#+RESULTS: int型変数の例
: weeknum = 7
: sizeof(int) = 4
: sizeof(weeknum) = 4

#+name: int型変数使用の実行例
#+begin_src shell :results output
  gcc -Wall use_int.c -o use_int
  ./use_int
#+end_src

#+RESULTS: int型変数使用の実行例
: weeknum = 7
: sizeof(int) = 4
: sizeof(weeknum) = 4

*** 文字型 char

文字を保持するchar型の変数を使用する以下のプログラムを作成し、実行してみなさい。

#+name: char型変数の例
#+begin_src C :results output :tangle use_char.c
  #include <stdio.h>

  int main(void) {
    char a = 'a';
    printf("a = %c\n", a);

    printf("sizeof(char) = %zd\n", sizeof(char));
    printf("sizeof(a) = %zd\n", sizeof(a));

    return 0;
  }
#+end_src

#+RESULTS: char型変数の例
: a = a
: sizeof(char) = 1
: sizeof(a) = 1

#+begin_src shell :results output
  gcc -Wall use_char.c -o use_char
  ./use_char
#+end_src

#+RESULTS:
: a = a
: sizeof(char) = 1
: sizeof(a) = 1

文字型という型ですが、sizeof(char)の結果を見るようにサイズは1バイトです。
そのため、多バイト文字を扱おうとするとコンパイル時に警告が出ます。
1バイトサイズの変数を保持する型と保持する型と覚えればいいでしょう。

**** DONE float型の引数を受け取り、その値の2乗を返す関数square_floatを作成し、実際に使用してみよ。

#+name: square_floatの利用
#+begin_src C :tangle use_square.c
  float square_float(float x) {
    return x * x;
  }

  int main(void) {
    float x = 2.0;

    printf("square_float(%f) = %f\n", x, square_float(x));

    return 0;
  }
#+end_src

#+RESULTS: square_floatの利用
: square_float(2.000000) = 4.000000

**** DONE float型の引数を受け取り、その値の3乗を返す関数cube_floatを作成し、実際に使用してみよ。

作成にあたり、square_floatを利用せよ。

#+name: cube_floatの利用
#+begin_src C :tangle use_cube.c
  float square_float(float x) {
    return x * x;
  }

  float cube_float(float x) {
    return x * square_float(x);
  }

  int main(void) {
    float x = 2.0;

    printf("cube_float(%f) = %f\n", x, cube_float(x));

    return 0;
  }
#+end_src

#+RESULTS:
: cube_float(2.000000) = 8.000000

**** DONE float型の引数を受け取り、その値の4乗を返す関数quad_floatを作成し、実際に使用してみよ。

作成にあたり、square_floatを利用せよ。

#+name: quad_floatの利用
#+begin_src C :tangle use_quad.c
  float square_float(float x) {
    return x * x;
  }

  float quad_float(float x) {
    return square_float(square_float(x));
  }

  int main(void) {
    float x = 2.0;

    printf("quad_float(%f) = %f\n", x, quad_float(x));

    return 0;
  }
#+end_src

#+RESULTS: quad_floatの利用
: quad_float(2.000000) = 16.000000

**** DONE 2つの整数の和を計算する関数addを作成し実際に使用してみよ。(add.c)

#+name: addの利用
#+begin_src C :tangle add.c
  #include <stdio.h>

  int add(int x, int y) {
    return x + y;
  }

  int main(void) {
    int x = 5;
    int y = 10;

    printf("%d + %d = %d\n", x, y, add(x, y));

    return 0;
  }
#+end_src

#+RESULTS: addの利用
: 5 + 10 = 15

**** DONE Hello, world!と画面に出力する関数printHelloを作成しなさい。

#+begin_src C :results output :tangle use_printHello.c :cache yes
  #include <stdio.h>

  void printHello(void) {
    printf("Hello, world!\n");
  }

  int main(void) {
    printHello();
    return 0;
  }
#+end_src

#+RESULTS[4ddd53710e2cfdc799c2d810b172a0ee0fd14e2b]:
: Hello, world!

** 条件判定に利用する演算子

#+name: eop01
#+begin_src C :results output :tangle eop01.c
#include <stdio.h>

int main(void)
{
  int x = 1;
  int y = 1;
  printf("(%d == %d) = %d\n", x, y, x == y);

  y = 2;
  printf("(%d == %d) = %d\n", x, y, x == y);

  return 0;
}
#+end_src

#+RESULTS: eop01
: (1 == 1) = 1
: (1 == 2) = 0

** 選択文

#+name: iseven
#+begin_src C :results output :tangle iseven01.c
#include <stdio.h>

int isEven(int x)
{
  int isEven = 0; /* 0:奇数, 1:偶数 */
  if(x % 2 == 0)
  {
    isEven = 1;
  }

  return isEven;
}

int main(void)
{
  int x = 5;
  printf("isEven(%d) = %d\n", x, isEven(x));

  x = 6;
  printf("isEven(%d) = %d\n", x, isEven(x));

  return 0;
}  
#+end_src

#+RESULTS:
: isEven(5) = 0
: isEven(6) = 1

**** シンプルな表

まずは、以下のような出力を目指してみよ。

#+begin_example
1  2  3  4  5  6  7  8  9
2  4  6  8 10 12 14 16 18
3  6  9 12 15 18 21 24 27
4  8 12 16 20 24 28 32 36
5 10 15 20 25 30 35 40 45
6 12 18 24 30 36 42 48 54
7 14 21 28 35 42 49 56 63
8 16 24 32 40 48 56 64 72
9 18 27 36 45 54 63 72 81
#+end_example

#+begin_comment
問題の解答例と記述箇所を離したい。
#+end_comment

#+name: simple-kuku
#+begin_src C :results output :cache yes :tangle simple-kuku.c
  #include <stdio.h>

  int main(void)
  {
    for(int i = 1; i < 10; i++) {
      for(int j = 1; j < 10; j++) {
        printf("%3d", i * j);
      }
      putchar('\n');
    }

    return 0;
  }
#+end_src

#+RESULTS[0f01cb8e64f3ce26e0d55f95e0a2d24e71868a49]: simple-kuku
: 1  2  3  4  5  6  7  8  9
: 2  4  6  8 10 12 14 16 18
: 3  6  9 12 15 18 21 24 27
: 4  8 12 16 20 24 28 32 36
: 5 10 15 20 25 30 35 40 45
: 6 12 18 24 30 36 42 48 54
: 7 14 21 28 35 42 49 56 63
: 8 16 24 32 40 48 56 64 72
: 9 18 27 36 45 54 63 72 81

**** ヘッダ情報を装飾の追加

以下のように行と列のヘッダを追加し、装飾を施してみよ。

#+begin_example
x |  1  2  3  4  5  6  7  8  9
--+---------------------------
1 |  1  2  3  4  5  6  7  8  9
2 |  2  4  6  8 10 12 14 16 18
3 |  3  6  9 12 15 18 21 24 27
4 |  4  8 12 16 20 24 28 32 36
5 |  5 10 15 20 25 30 35 40 45
6 |  6 12 18 24 30 36 42 48 54
7 |  7 14 21 28 35 42 49 56 63
8 |  8 16 24 32 40 48 56 64 72
9 |  9 18 27 36 45 54 63 72 81
#+end_example

#+name: deco-kuku
#+begin_src C :results output :cache yes :tangle deco-kuku.c
  #include <stdio.h>

  void printTopHeader(int num)
  {
    printf("x |");
    for(int i = 1; i <= num; i++) {
      printf("%3d", i);
    }
    putchar('\n');
  }

  int main(void)
  {
    printTopHeader(9);
    puts("--+---------------------------");
    for(int i = 1; i < 10; i++) {
      printf("%d |", i);
      for(int j = 1; j < 10; j++) {
        printf("%3d", i * j);
      }
      putchar('\n');
    }

    return 0;
  }
#+end_src

#+RESULTS[f766b3d35d66c71873783fe39b99cd801a508c88]: deco-kuku
#+begin_example
x |  1  2  3  4  5  6  7  8  9
--+---------------------------
1 |  1  2  3  4  5  6  7  8  9
2 |  2  4  6  8 10 12 14 16 18
3 |  3  6  9 12 15 18 21 24 27
4 |  4  8 12 16 20 24 28 32 36
5 |  5 10 15 20 25 30 35 40 45
6 |  6 12 18 24 30 36 42 48 54
7 |  7 14 21 28 35 42 49 56 63
8 |  8 16 24 32 40 48 56 64 72
9 |  9 18 27 36 45 54 63 72 81
#+end_example

**** 福利

元金,年利,年数を指定して各年毎の元金を表示させてみよ。
元金100万円、年利3%を想定し、得た利益はそのまま次年の元金にする。
10年後にいくらになるかを計算せよ。

| moto | rieki |
|  100 |   103 |
|  203 |       |

#+name: hukuri
#+begin_src C :cache yes :tangle hukuri.c
  #include <stdio.h>

  int main(void) {

    double gankin = 100;
    double nenri = 0.03;
    int nen = 10;

    for(int i = 0; i < nen; i++) {
      double rieki = gankin * nenri;
      printf("%d, %f, %f\n", i + 1, gankin, rieki);

      gankin += rieki;
    }

    return 0;
  }
#+end_src

#+RESULTS[5b16a43710b384b6a21d4a65180e1b2459667687]: hukuri
|  1 |      100.0 |      3.0 |
|  2 |      103.0 |     3.09 |
|  3 |     106.09 |   3.1827 |
|  4 |   109.2727 | 3.278181 |
|  5 | 112.550881 | 3.376526 |
|  6 | 115.927407 | 3.477822 |
|  7 |  119.40523 | 3.582157 |
|  8 | 122.987387 | 3.689622 |
|  9 | 126.677008 |  3.80031 |
| 10 | 130.477318 |  3.91432 |

**** 毎年, 福利

上記の想定を少し変更し、毎年元金に100万円を加えた場合を考えてみよ。

#+name: hukuri2
#+begin_src C :cache yes :tangle hukuri2.c
  #include <stdio.h>

  int main(void) {

    double gankin = 100;
    double mai = 100;
    double nenri = 0.03;
    int nen = 10;

    for(int i = 0; i < nen; i++) {
      double rieki = gankin * nenri;
      printf("%d, %f, %f\n", i + 1, gankin, rieki);

      gankin += mai + rieki;
    }

    return 0;
  }
#+end_src

#+RESULTS[d82b297e8b366e7c68ca6b864ae74f52c672c2bf]: hukuri2
|  1 |       100.0 |       3.0 |
|  2 |       203.0 |      6.09 |
|  3 |      309.09 |    9.2727 |
|  4 |    418.3627 | 12.550881 |
|  5 |  530.913581 | 15.927407 |
|  6 |  646.840988 |  19.40523 |
|  7 |  766.246218 | 22.987387 |
|  8 |  889.233605 | 26.677008 |
|  9 | 1015.910613 | 30.477318 |
| 10 | 1146.387931 | 34.391638 |

**** 9x9の2次元配列に掛け算九九を保存し画面に表を出力させなさい

#+begin_src C :results output :tangle kuku2d.c :cache yes
  #include <stdio.h>

  int main(void) {
    int kuku[9][9];

    for(int gyou = 1; gyou <= 9; gyou++) {
      for(int retsu = 1; retsu <= 9; retsu++) {
        kuku[gyou-1][retsu-1] = gyou * retsu;
      }
    }

    for(int gyou = 1; gyou <= 9; gyou++) {
      for(int retsu = 1; retsu <= 9; retsu++) {
        printf("%3d", kuku[gyou-1][retsu-1]);
      }
      putchar('\n');
    }

    return 0;
  }
#+end_src

#+RESULTS[95bb84953113f4f1249936a3eabcc34defe07a51]:
: 1  2  3  4  5  6  7  8  9
: 2  4  6  8 10 12 14 16 18
: 3  6  9 12 15 18 21 24 27
: 4  8 12 16 20 24 28 32 36
: 5 10 15 20 25 30 35 40 45
: 6 12 18 24 30 36 42 48 54
: 7 14 21 28 35 42 49 56 63
: 8 16 24 32 40 48 56 64 72
: 9 18 27 36 45 54 63 72 81



1. breekの利用
2. gotoの利用

** 積を計算するプログラムを和で実装しなさい。

#+begin_src C
  int mul(int x, int y) {
    int sum = 0;
    for(int i = 0; i < y; i++) {
      sum += x;
    }

    return sum;
  }

  int main(void) {
    int x = 3;
    int y = 7;
    printf("%d * %d = %d\n", x, y, mul(x, y));

    return 0;
  }
#+end_src

#+RESULTS:
: 3 * 7 = 21

実装後以下を考えてみなさい。

- xまたはyが0の場合、積の結果は0となる。この場合は、繰り返しによる和の実行は不要である。
  作成したプログラムにこの考えが入っていない場合、実装してみよ。
- xが1の場合、積の結果はyである。また、yが1の場合、積の結果はxである。
  作成したプログラムにこの考えが入っていない場合、実装してみよ。

*** map関数

#+begin_comment
これは関数ポインタの例にしたほうが良いかもしれないな。
#+end_comment

関数型の言語にはmapが用意されているC言語にてmapの機能を模倣してみよ。
以下は、emacs-lispでmapに相当するmapcarを使用した例である。

#+name: mapの例
#+begin_src elisp
  (defun square (x) (* x x))
  (mapcar #'square '(1 2 3 4 5))
#+end_src

#+RESULTS: mapの例
| 1 | 4 | 9 | 16 | 25 |

まずは、mapを意識せずに適当に同じような処理を実装してみる。
C言語ということで配列を利用して実装してみる。

#+begin_src C :results output
  #include <stdio.h>

  int square(int x) {
    return x * x;
  }

  int main(void) {
    int a[] = { 1, 2, 3, 4, 5 };

    for(int i = 0; i < sizeof(a)/sizeof(int); i++) {
      a[i] = square(a[i]);
    }

    for(int i = 0; i < sizeof(a)/sizeof(int); i++) {
      printf("%d ", a[i]);
    }

    return 0;
  }
#+end_src

#+RESULTS:
: 1 4 9 16 25 

元の配列を変更するのは気持ちが悪いので、保存先の配列を用意することにする。

#+begin_src C
  #include <stdio.h>

  int square(int x) {
    return x * x;
  }

  int main(void) {
    int a[] = { 1, 2, 3, 4, 5 };
    int ra[sizeof(a)/sizeof(int)];

    for(int i = 0; i < sizeof(a)/sizeof(int); i++) {
      ra[i] = square(a[i]);
    }

    for(int i = 0; i < sizeof(a)/sizeof(int); i++) {
      printf("%d ", ra[i]);
    }

    return 0;
  }
#+end_src

#+RESULTS:
: 1 4 9 16 25

map部分を関数化する。

#+begin_src C
  #include <stdio.h>

  int square(int x) {
    return x * x;

  }

  void map(int (*func)(int), int a[], size_t num, int ra[]) {
    for(int i = 0; i < num; i++) {
      ra[i] = func(a[i]);
    }
  }

  int main(void) {
    int a[] = { 1, 2, 3, 4, 5 };
    int ra[sizeof(a)/sizeof(int)];

    map(square, a, sizeof(a)/sizeof(int), ra);

    for(int i = 0; i < sizeof(a)/sizeof(int); i++) {
      printf("%d ", ra[i]);
    }

    return 0;
  }
#+end_src

#+RESULTS:
: 1 4 9 16 25

mapのfuncはint型を引数にとる関数となっているが、ここで任意の型をとることはできるだろうか。
考えてみよ。

2次元のデカルト座標系の点を表す構造体を用意し、原点からの距離を求めてみる。

#+begin_comment
意外と面倒だな。
#+end_comment

*** 元の配列の変更を許可する場合の解答例

#+begin_src C :results raw :noweb yes :cache yes :include <stdio.h>
  int main(void) {

    <<入力配列>>

    /* 2乗の計算結果で更新する。*/
    for(int i = 0; i < sizeof(array)/sizeof(int); i++) {
      array[i] = array[i] * array[i];
    }

    /* 計算結果を確認する。*/
    for(int i = 0; i < sizeof(array)/sizeof(int); i++) {
      printf("array[%d] = %3d\n", i, array[i]);
    }

    return 0;
  }
#+end_src

#+RESULTS[1131e0893b61ab3335b67d767404ba6dfbda6115]:
array[0] =   1
array[1] =   4
array[2] =   9
array[3] =  16
array[4] =  25
array[5] =  36
array[6] =  49
array[7] =  64
array[8] =  81
array[9] = 100

上記のプログラムを変更して遊んでみる。

  1. 2上を計算する部分を関数化してみよ。
  2. 計算結果を確認する部分を関数化してみよ。
     1. まずは、思いつくままに関数化してみよ。
     2. 汎用性を上げるにはどうすればよいだろうか。

**** 2乗を計算する部分の関数化

#+name: square関数実装
#+begin_src C
  int square(int x) {
    return x * x;
  }
#+end_src

#+begin_src C :results raw :noweb yes :cache yes :include <stdio.h>
  <<square関数実装>>
  
  int main(void) {

    <<入力配列>>

    /* 2乗の計算結果で更新する。*/
    for(int i = 0; i < sizeof(array)/sizeof(int); i++) {
      array[i] = square(array[i]);
    }

    /* 計算結果を確認する。*/
    for(int i = 0; i < sizeof(array)/sizeof(int); i++) {
      printf("array[%d] = %3d\n", i, array[i]);
    }

    return 0;
  }
#+end_src

#+RESULTS[6dc8949151da5df8fe1207404fe1297c5964c03e]:
array[0] =   1
array[1] =   4
array[2] =   9
array[3] =  16
array[4] =  25
array[5] =  36
array[6] =  49
array[7] =  64
array[8] =  81
array[9] = 100

**** 結果確認部分の関数化

まずは、思いつくままに書いてみる。

#+name: print_results
#+begin_src C
  #include <stdio.h>

  void print_results(int array[], size_t size) {
    for(int i = 0; i < size; i++) {
      printf("array[%d] = %3d\n", i, array[i]);
    }
  }
#+end_src

#+RESULTS: print_results

#+begin_src C :results raw :noweb yes :cache yes :include <stdio.h>
  
  <<square関数実装>>
  <<print_results>>

  int main(void) {

    <<入力配列>>

    /* 2乗の計算結果で更新する。*/
    for(int i = 0; i < sizeof(array)/sizeof(int); i++) {
      array[i] = square(array[i]);
    }

    /* 計算結果を確認する。*/
    print_results(array, sizeof(array)/sizeof(int));

    return 0;
  }
#+end_src

#+RESULTS[adcdad4d9dea7048434e035324d746dd98e700fd]:
array[0] =   1
array[1] =   4
array[2] =   9
array[3] =  16
array[4] =  25
array[5] =  36
array[6] =  49
array[7] =  64
array[8] =  81
array[9] = 100

[[print_results]]は、配列の識別子まで、実装側で入れ込んでいる。これを外部から指定可能にする方法は
あるだろうか。より汎用的なことが可能かを考えてみよ。

識別子を文字列として受取り出力を変更する程度しか行えなさそうである。

** 配列とアドレス

#+begin_src C :results output
  #include <stdio.h>

  int main(void) {
    int a2[10][10];

    int count = 0;
    for(int i = 0; i < 10; i ++) {
      for(int j = 0; j < 10; j++) {
        a2[i][j] = count;
        count++;
      }
    }

    /* 先頭から1要素毎にアドレス出力 */
    /* 10行10列 */
    for(int i = 0; i < 10; i ++) {
      for(int j = 0; j < 10; j++) {
        printf("%p : a2[%d][%d] = %3d\n", &a2[i][j], i, j, a2[i][j]);
      }
    }

    /* 1行100列の配列として見た場合 */
    int *ap = (int *)a2;
    for(int i = 0; i < 100; i++) {
      printf("%p : ap[%d] = %3d\n", &ap[i], i, ap[i]);
    }

    #if 0
    /* 5行20列の配列として見た場合 */
    int *ap2 = (int [5])a2;
    for(int i = 0; i < 5; i ++) {
      for(int j = 0; j < 20; j++) {
        /* 修正中 */
        printf("%p : ap2[%d][%d] = %3d\n", &ap2[i][j], i, j, ap2[i][j]);
      }
    }
    #endif
  }
#+end_src

#+RESULTS:
#+begin_example
0x7ffcda285bf0 : a2[0][0] =   0
0x7ffcda285bf4 : a2[0][1] =   1
0x7ffcda285bf8 : a2[0][2] =   2
0x7ffcda285bfc : a2[0][3] =   3
0x7ffcda285c00 : a2[0][4] =   4
0x7ffcda285c04 : a2[0][5] =   5
0x7ffcda285c08 : a2[0][6] =   6
0x7ffcda285c0c : a2[0][7] =   7
0x7ffcda285c10 : a2[0][8] =   8
0x7ffcda285c14 : a2[0][9] =   9
0x7ffcda285c18 : a2[1][0] =  10
0x7ffcda285c1c : a2[1][1] =  11
0x7ffcda285c20 : a2[1][2] =  12
0x7ffcda285c24 : a2[1][3] =  13
0x7ffcda285c28 : a2[1][4] =  14
0x7ffcda285c2c : a2[1][5] =  15
0x7ffcda285c30 : a2[1][6] =  16
0x7ffcda285c34 : a2[1][7] =  17
0x7ffcda285c38 : a2[1][8] =  18
0x7ffcda285c3c : a2[1][9] =  19
0x7ffcda285c40 : a2[2][0] =  20
0x7ffcda285c44 : a2[2][1] =  21
0x7ffcda285c48 : a2[2][2] =  22
0x7ffcda285c4c : a2[2][3] =  23
0x7ffcda285c50 : a2[2][4] =  24
0x7ffcda285c54 : a2[2][5] =  25
0x7ffcda285c58 : a2[2][6] =  26
0x7ffcda285c5c : a2[2][7] =  27
0x7ffcda285c60 : a2[2][8] =  28
0x7ffcda285c64 : a2[2][9] =  29
0x7ffcda285c68 : a2[3][0] =  30
0x7ffcda285c6c : a2[3][1] =  31
0x7ffcda285c70 : a2[3][2] =  32
0x7ffcda285c74 : a2[3][3] =  33
0x7ffcda285c78 : a2[3][4] =  34
0x7ffcda285c7c : a2[3][5] =  35
0x7ffcda285c80 : a2[3][6] =  36
0x7ffcda285c84 : a2[3][7] =  37
0x7ffcda285c88 : a2[3][8] =  38
0x7ffcda285c8c : a2[3][9] =  39
0x7ffcda285c90 : a2[4][0] =  40
0x7ffcda285c94 : a2[4][1] =  41
0x7ffcda285c98 : a2[4][2] =  42
0x7ffcda285c9c : a2[4][3] =  43
0x7ffcda285ca0 : a2[4][4] =  44
0x7ffcda285ca4 : a2[4][5] =  45
0x7ffcda285ca8 : a2[4][6] =  46
0x7ffcda285cac : a2[4][7] =  47
0x7ffcda285cb0 : a2[4][8] =  48
0x7ffcda285cb4 : a2[4][9] =  49
0x7ffcda285cb8 : a2[5][0] =  50
0x7ffcda285cbc : a2[5][1] =  51
0x7ffcda285cc0 : a2[5][2] =  52
0x7ffcda285cc4 : a2[5][3] =  53
0x7ffcda285cc8 : a2[5][4] =  54
0x7ffcda285ccc : a2[5][5] =  55
0x7ffcda285cd0 : a2[5][6] =  56
0x7ffcda285cd4 : a2[5][7] =  57
0x7ffcda285cd8 : a2[5][8] =  58
0x7ffcda285cdc : a2[5][9] =  59
0x7ffcda285ce0 : a2[6][0] =  60
0x7ffcda285ce4 : a2[6][1] =  61
0x7ffcda285ce8 : a2[6][2] =  62
0x7ffcda285cec : a2[6][3] =  63
0x7ffcda285cf0 : a2[6][4] =  64
0x7ffcda285cf4 : a2[6][5] =  65
0x7ffcda285cf8 : a2[6][6] =  66
0x7ffcda285cfc : a2[6][7] =  67
0x7ffcda285d00 : a2[6][8] =  68
0x7ffcda285d04 : a2[6][9] =  69
0x7ffcda285d08 : a2[7][0] =  70
0x7ffcda285d0c : a2[7][1] =  71
0x7ffcda285d10 : a2[7][2] =  72
0x7ffcda285d14 : a2[7][3] =  73
0x7ffcda285d18 : a2[7][4] =  74
0x7ffcda285d1c : a2[7][5] =  75
0x7ffcda285d20 : a2[7][6] =  76
0x7ffcda285d24 : a2[7][7] =  77
0x7ffcda285d28 : a2[7][8] =  78
0x7ffcda285d2c : a2[7][9] =  79
0x7ffcda285d30 : a2[8][0] =  80
0x7ffcda285d34 : a2[8][1] =  81
0x7ffcda285d38 : a2[8][2] =  82
0x7ffcda285d3c : a2[8][3] =  83
0x7ffcda285d40 : a2[8][4] =  84
0x7ffcda285d44 : a2[8][5] =  85
0x7ffcda285d48 : a2[8][6] =  86
0x7ffcda285d4c : a2[8][7] =  87
0x7ffcda285d50 : a2[8][8] =  88
0x7ffcda285d54 : a2[8][9] =  89
0x7ffcda285d58 : a2[9][0] =  90
0x7ffcda285d5c : a2[9][1] =  91
0x7ffcda285d60 : a2[9][2] =  92
0x7ffcda285d64 : a2[9][3] =  93
0x7ffcda285d68 : a2[9][4] =  94
0x7ffcda285d6c : a2[9][5] =  95
0x7ffcda285d70 : a2[9][6] =  96
0x7ffcda285d74 : a2[9][7] =  97
0x7ffcda285d78 : a2[9][8] =  98
0x7ffcda285d7c : a2[9][9] =  99
0x7ffcda285bf0 : ap[0] =   0
0x7ffcda285bf4 : ap[1] =   1
0x7ffcda285bf8 : ap[2] =   2
0x7ffcda285bfc : ap[3] =   3
0x7ffcda285c00 : ap[4] =   4
0x7ffcda285c04 : ap[5] =   5
0x7ffcda285c08 : ap[6] =   6
0x7ffcda285c0c : ap[7] =   7
0x7ffcda285c10 : ap[8] =   8
0x7ffcda285c14 : ap[9] =   9
0x7ffcda285c18 : ap[10] =  10
0x7ffcda285c1c : ap[11] =  11
0x7ffcda285c20 : ap[12] =  12
0x7ffcda285c24 : ap[13] =  13
0x7ffcda285c28 : ap[14] =  14
0x7ffcda285c2c : ap[15] =  15
0x7ffcda285c30 : ap[16] =  16
0x7ffcda285c34 : ap[17] =  17
0x7ffcda285c38 : ap[18] =  18
0x7ffcda285c3c : ap[19] =  19
0x7ffcda285c40 : ap[20] =  20
0x7ffcda285c44 : ap[21] =  21
0x7ffcda285c48 : ap[22] =  22
0x7ffcda285c4c : ap[23] =  23
0x7ffcda285c50 : ap[24] =  24
0x7ffcda285c54 : ap[25] =  25
0x7ffcda285c58 : ap[26] =  26
0x7ffcda285c5c : ap[27] =  27
0x7ffcda285c60 : ap[28] =  28
0x7ffcda285c64 : ap[29] =  29
0x7ffcda285c68 : ap[30] =  30
0x7ffcda285c6c : ap[31] =  31
0x7ffcda285c70 : ap[32] =  32
0x7ffcda285c74 : ap[33] =  33
0x7ffcda285c78 : ap[34] =  34
0x7ffcda285c7c : ap[35] =  35
0x7ffcda285c80 : ap[36] =  36
0x7ffcda285c84 : ap[37] =  37
0x7ffcda285c88 : ap[38] =  38
0x7ffcda285c8c : ap[39] =  39
0x7ffcda285c90 : ap[40] =  40
0x7ffcda285c94 : ap[41] =  41
0x7ffcda285c98 : ap[42] =  42
0x7ffcda285c9c : ap[43] =  43
0x7ffcda285ca0 : ap[44] =  44
0x7ffcda285ca4 : ap[45] =  45
0x7ffcda285ca8 : ap[46] =  46
0x7ffcda285cac : ap[47] =  47
0x7ffcda285cb0 : ap[48] =  48
0x7ffcda285cb4 : ap[49] =  49
0x7ffcda285cb8 : ap[50] =  50
0x7ffcda285cbc : ap[51] =  51
0x7ffcda285cc0 : ap[52] =  52
0x7ffcda285cc4 : ap[53] =  53
0x7ffcda285cc8 : ap[54] =  54
0x7ffcda285ccc : ap[55] =  55
0x7ffcda285cd0 : ap[56] =  56
0x7ffcda285cd4 : ap[57] =  57
0x7ffcda285cd8 : ap[58] =  58
0x7ffcda285cdc : ap[59] =  59
0x7ffcda285ce0 : ap[60] =  60
0x7ffcda285ce4 : ap[61] =  61
0x7ffcda285ce8 : ap[62] =  62
0x7ffcda285cec : ap[63] =  63
0x7ffcda285cf0 : ap[64] =  64
0x7ffcda285cf4 : ap[65] =  65
0x7ffcda285cf8 : ap[66] =  66
0x7ffcda285cfc : ap[67] =  67
0x7ffcda285d00 : ap[68] =  68
0x7ffcda285d04 : ap[69] =  69
0x7ffcda285d08 : ap[70] =  70
0x7ffcda285d0c : ap[71] =  71
0x7ffcda285d10 : ap[72] =  72
0x7ffcda285d14 : ap[73] =  73
0x7ffcda285d18 : ap[74] =  74
0x7ffcda285d1c : ap[75] =  75
0x7ffcda285d20 : ap[76] =  76
0x7ffcda285d24 : ap[77] =  77
0x7ffcda285d28 : ap[78] =  78
0x7ffcda285d2c : ap[79] =  79
0x7ffcda285d30 : ap[80] =  80
0x7ffcda285d34 : ap[81] =  81
0x7ffcda285d38 : ap[82] =  82
0x7ffcda285d3c : ap[83] =  83
0x7ffcda285d40 : ap[84] =  84
0x7ffcda285d44 : ap[85] =  85
0x7ffcda285d48 : ap[86] =  86
0x7ffcda285d4c : ap[87] =  87
0x7ffcda285d50 : ap[88] =  88
0x7ffcda285d54 : ap[89] =  89
0x7ffcda285d58 : ap[90] =  90
0x7ffcda285d5c : ap[91] =  91
0x7ffcda285d60 : ap[92] =  92
0x7ffcda285d64 : ap[93] =  93
0x7ffcda285d68 : ap[94] =  94
0x7ffcda285d6c : ap[95] =  95
0x7ffcda285d70 : ap[96] =  96
0x7ffcda285d74 : ap[97] =  97
0x7ffcda285d78 : ap[98] =  98
0x7ffcda285d7c : ap[99] =  99
#+end_example


